avnet-iotconnect/iotc-mchp-dspic33/firmware/dspic33ak512mps512_rnwf11_iotconnect.X/mcc_generated_files/system/src/pins.c
/**
 * PINS Generated Driver Source File 
 * 
 * @file      pins.c
 *            
 * @ingroup   pinsdriver
 *            
 * @brief     This is the generated driver source file for PINS driver.
 *
 * @skipline @version   PLIB Version 1.0.5
 *
 * @skipline  Device : dsPIC33AK512MPS512
*/

/*
� [2026] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

// Section: Includes
#include <xc.h>
#include <stddef.h>
#include "../pins.h"

// Section: File specific functions

// Section: Driver Interface Function Definitions
void PINS_Initialize(void)
{
    /****************************************************************************
     * Setting the Output Latch SFR(s)
     ***************************************************************************/
    LATA = 0x0000UL;
    LATB = 0x0000UL;
    LATC = 0x0000UL;
    LATD = 0x0000UL;
    LATE = 0x0000UL;
    LATF = 0x0000UL;
    LATG = 0x0000UL;
    LATH = 0x0002UL;

    /****************************************************************************
     * Setting the GPIO Direction SFR(s)
     ***************************************************************************/
    TRISA = 0xFFFFUL;
    TRISB = 0xFFFFUL;
    TRISC = 0x00FFUL;
    TRISD = 0x9DFAUL;
    TRISE = 0x077FUL; // bit 7 (RE7 / P69 / mikroBUS A TX) cleared to make it a UART2 TX output
    TRISF = 0x0FEFUL;
    TRISG = 0x03F7UL;
    TRISH = 0x0005UL;


    /****************************************************************************
     * Setting the Weak Pull Up and Weak Pull Down SFR(s)
     ***************************************************************************/
    CNPUA = 0x0000UL;
    CNPUB = 0x0000UL;
    CNPUC = 0x0000UL;
    CNPUD = 0x0000UL;
    CNPUE = 0x0000UL;
    CNPUF = 0x0000UL;
    CNPUG = 0x0000UL;
    CNPUH = 0x0000UL;
    CNPDA = 0x0000UL;
    CNPDB = 0x0000UL;
    CNPDC = 0x0000UL;
    CNPDD = 0x0000UL;
    CNPDE = 0x0000UL;
    CNPDF = 0x0000UL;
    CNPDG = 0x0000UL;
    CNPDH = 0x0000UL;


    /****************************************************************************
     * Setting the Open Drain SFR(s)
     ***************************************************************************/
    ODCA = 0x0000UL;
    ODCB = 0x0000UL;
    ODCC = 0x0000UL;
    ODCD = 0x0000UL;
    ODCE = 0x0000UL;
    ODCF = 0x0000UL;
    ODCG = 0x0000UL;
    ODCH = 0x0000UL;


    /****************************************************************************
     * Setting the Analog/Digital Configuration SFR(s)
     ***************************************************************************/
    ANSELA = 0x7FFFUL; // bit 15 (RA15 / P79 / mikroBUS A RST) cleared for digital I/O - see MCLR_* macros in pins.h
    ANSELB = 0xFFFFUL;
    ANSELE = 0x0003UL;
    ANSELF = 0x0001UL;

    /****************************************************************************
     * Set the PPS
     ***************************************************************************/
      PINS_PPSUnlock(); // unlock PPS

        // UART1 - debug console, routed to the on-board debugger's USB-UART bridge (unchanged from the OOB demo)
        RPINR13bits.U1RXR = 0x0032UL; //RD1->UART1:U1RX;
        RPOR28bits.RP114R = 0x0013UL;  //RH1->UART1:U1TX;

        // UART2 - RNWF11 AT-command link, routed to mikroBUS A (RX=P71/RE8/RP73, TX=P69/RE7/RP72)
        // Values are 0x0015 (=21, "U2TX") and 0x0049 (=73, RP73) per the RPOR/RPINR Output/Input
        // Function tables in the dsPIC33AK512MPS512 Family Data Sheet (DS70005591), section 6 (PPS).
        RPINR13bits.U2RXR = 0x0049UL; //RP73 (P71/RE8, mikroBUS A pin 14)->UART2:U2RX;
        RPOR17bits.RP72R  = 0x0015UL; //RP72 (P69/RE7, mikroBUS A pin 13)->UART2:U2TX;

      PINS_PPSLock(); // lock PPS


}

